{
  "postTitle": "Disabling Disqus for blog comments",
  "timestamp": "1614401359",
  "editedTimestamp": "",
  "postContent": "<p>In my latest release of <a href=\"http://github.com/pedroCX486/ngx-dumblog\">ngx-Dumblog</a>, I added the option to show a message (that you can see at the bottom of this very post) that says if you have comments, send me an email. Before that you had the option to use Disqus or simply have nothing down there to show you were interested in comments/feedback on a post (that's still available). And I used that to remove Disqus from my blog.</p><p>But why?</p><p>I saw recently a post on Hacker News (that I can't for the life of me find the link), in which the author did the same thing for the sake of privacy. Disqus recently started using some <i>very </i>shady tactics like enforcing 3rd party cookies and having you <strong>pay </strong>to disable ads in your blog comments. My major issue with that is the absurd amount of tracking injected along with Disqus in your page for the simple act of enabling users to comment on something, if you had uBlock on your browser you could check the console the see the absurd amount of messages showing blocked content.</p><p>But the answer is pretty simple beyond that: I don't want you that is a visitor here to read my rambles to be tracked all over the web just because. For these things to end, we have to fight back. My blog contains no tracking, no cookies and the code is opensourced under the WTFPL for you to check it out. Recently we are seeing an pushback against companies like Facebook (mostly by Apple and Mozilla, but I'm keeping a healthy amount skepticism regarding Apple) to keep users data private and to reduce tracking to a minimum, to give users the option of choosing what they want.</p><p>So basically this is what I did, the blog platform now enables its users to choose if they still want to use Disqus or not. In my case, in my own dogfood blog, I decided that I don't want to bend over to them.</p><p>So as the message at the bottom says, if you have a comment or even anything to say, I'm all ears. Send me an email. :-)</p>",
  "filename": "disabling-disqus-for-blog-comments",
  "draft": false
}