{
  "postTitle": "Starting a simple bash script on Raspbian/RaspiOS is hell...",
  "timestamp": "1605325005",
  "editedTimestamp": "",
  "postContent": "<p>So, it's 00:12 here. I was (still am) setting up my brand new RPi4, the shiny 8GB version to replace my old cranky RPi3b. New hardware, same hell as always with Raspbian (or RaspiOS or Raspberry Pi OS or however the hell they call it these days).</p><p>I run on it some apps I use on my local network (basically my fancy app hub) and one of these apps is a Node.js API. Usually one would say “oh that's simple use PM2 and that's it!” but for some god forsaken reason it didn't work on me.</p><p>I had just finished configuring Nextcloud and Gitea (and that went fine, as you can define the word…) and went to bring back up my Node API. As mentioned PM2 didn't work, so I went the classic way of having LXDE start a terminal and run a bash script with the commands needed.</p><p>No biggie, right? No.</p><p>The documentation for the RPi is… Well, fiddly. If you can call it that. I absolutely despise the crazy mish-mash of things you have on the internet regarding Raspbian/RaspiOS (starting by the friggin' name change!) because you simply can't easily find what works or doesn't with newer versions.</p><p>So this blog post is both a reminder to ME and a tutorial to you, fellow internet traveler that ever happens to stumble across it if you need to do the same thing.</p><p><span class=\"text-big\"><strong>HOW TO START A TERMINAL AND LAUNCH A BASH SCRIPT ON THE RASPBERRY PI OS: THE F*CKING TUTORIAL</strong></span></p><ol><li>Boot your Pi to the <strong>GUI</strong>, not command line, obviously.</li><li>Write your script and test it on the terminal (and for fuck's sake remember that the <strong>FIRST LINE</strong> should always be <strong>#!/bin/bash</strong>).</li><li>Save your script in an easy path to access (such as <strong>/home/pi</strong>) and with the <strong>.sh</strong> extension.</li><li>Open a terminal and run: <strong>sudo chmod +x /home/pi/your_script.sh</strong></li><li>Open an text editor with the <strong>sudo </strong>command (any you prefer, but <strong>IT NEEDS TO BE AS ROOT</strong>).</li><li>Navigate to <strong>/etc/xdg/lxsession/LXDE-pi</strong></li><li>Open the file called <strong>autostart</strong></li><li><strong>BEFORE THE LINE THAT STARTS WITH @XSCREENSAVER</strong> add a new line: <strong>@lxterminal --command \"/home/pi/your_script.sh\"</strong> (Why before @xscreensaver? Who knows. Do after it and you'll never see it execute.)</li><li><strong>DO FUCKING NOT</strong> put a . (dot) before the path, and <strong>INCLUDE THE DOUBLE QUOTES IN THE PATH</strong>.</li><li>That's it.</li></ol><p>Beware that if your script does something (like launching a node app that auto-closes) and then closes after (or the app crashes…), you may want to add something like a sleep or pause command, if you want to see it running or its output.</p><p>PS: I know the tone of the text is “violent”, this is literally how I write notes to myself so I can remember things. (Why? &nbsp;Because I'm a dumbass.)<br>I usually don't share these, but considering the hellish experience I had with the PiOS (both on my 3 and 4), I wanted to share it at least so I have a permanent archive on the internet with it.</p><p>Hope it was helpful to someone out there.</p><p>I gathered all content/commands from here: <a href=\"https://www.raspberrypi.org/forums/viewtopic.php?t=65607\">https://www.raspberrypi.org/forums/viewtopic.php?t=65607</a></p>",
  "filename": "starting-a-simple-bash-script-on-raspbian-raspios",
  "draft": false
}
